{
    "id": 1,
    "bid": "Программа Tech Orda",
    "img": "https://ik.imagekit.io/eimwe/courses/python.jpg",
    "desc": "Курс дает возможность познакомиться с основными понятиями и особенностями языка и системы Python. Рассматриваются основные конструкции языка и встроенные функции, создание модулей и пакетов, инструменты функционального программирования, основные библиотеки Python для работы с данными.",
    "goal": "Изучить основы алгоритмизации вычислительных процессов и возможности языка программирования Python при решении различных прикладных задач. Каждая работа сопровождается пояснениями и контрольными вопросами, направленными на повышение качества усвоения материала",
    "price": "600 000",
    "title": "Python – разработчик",
    "format": "Гибрид",
    "result": "В результате обучения обучающиеся должны уметь создавать телеграм-ботов, сайты, приложения, нейросети и использовать Python для научных исследований — теория и практика на реальных задачах. Должен демонстрировать способность и готовность применять полученные знания в практической деятельности. При успешной сдаче экзамена, обучающийся получает квалификацию Junior (Strong) Python-разработчик",
    "skills": [
      {
        "id": 1,
        "text": "выбирать и применять базовые типы данных и структуры данных языка программирования Python  для решения прикладных задач"
      },
      {
        "id": 2,
        "text": "разрабатывать собственные функции на языке программирования Python. Передавать аргументы в функции, возвращать результат из функции для решения прикладных задач"
      },
      {
        "id": 3,
        "text": "писать программный код на языке программирования Python , запускать и отлаживать свой код для решения прикладных задач"
      }
    ],
    "control": "Экзамен",
    "mentors": [
      {
        "id": 1,
        "exp": "15 лет",
        "img": "/mentor-1.jpg",
        "name": "Куратор 1"
      },
      {
        "id": 2,
        "exp": "15 лет",
        "img": "/mentor-2.jpg",
        "name": "Куратор 2"
      }
    ],
    "program": [
      {
        "id": 1,
        "theme": "Язык программирования Python. Правила создания и выполнения программ",
        "marker": "Тема"
      },
      {
        "id": 2,
        "theme": "Структура программы на языке Python",
        "marker": "Тема"
      },
      {
        "id": 3,
        "theme": "Основные управляющие конструкции линейного алгоритма",
        "marker": "Тема"
      },
      {
        "id": 4,
        "theme": "Арифметические и логические выражения. Модуль math. Условный оператор if",
        "marker": "Тема"
      },
      {
        "id": 5,
        "theme": "Основные управляющие конструкции циклического алгоритма в Python. Цикл for. Функция range",
        "marker": "Тема"
      },
      {
        "id": 6,
        "theme": "Основные управляющие конструкции циклического алгоритма в Python. Цикл while",
        "marker": "Тема"
      },
      {
        "id": 7,
        "theme": "Основные управляющие конструкции циклического алгоритма в Python. Вложенные циклы",
        "marker": "Тема"
      },
      {
        "id": 8,
        "theme": "Символьные данные в Python. Базовые операции со строками",
        "marker": "Тема"
      },
      {
        "id": 9,
        "theme": "Символьные данные в Python. Методы строк",
        "marker": "Тема"
      },
      {
        "id": 10,
        "theme": "Фундаментальная структура данных - список в Python",
        "marker": "Тема"
      },
      {
        "id": 11,
        "theme": "Элементы структуризации программы в Python",
        "marker": "Тема"
      },
      {
        "id": 12,
        "theme": "Структуры данных: множества и словари в Python",
        "marker": "Тема"
      }
    ],
    "features": [
      {
        "id": 1,
        "item": "Гибрид",
        "title": "Форма обучения"
      },
      {
        "id": 2,
        "item": "казахский / русский",
        "title": "Язык обучения"
      },
      {
        "id": 3,
        "item": "26",
        "title": "Количество недель"
      },
      {
        "id": 4,
        "item": "18-45 лет",
        "title": "Возраст обучающихся"
      },
      {
        "id": 5,
        "item": "4 часа",
        "title": "Количество занятий и учебных часов в неделю"
      },
      {
        "id": 6,
        "item": "104 часа",
        "title": "Количество учебных часов за год"
      },
      {
        "id": 7,
        "item": "Junior (Strong) Python-разработчик",
        "title": "Квалификация по завершению курса"
      }
    ],
    "knowhows": [
      {
        "id": 1,
        "text": "тенденции и перспективы  развития современных инструментальных сред разработки программ"
      },
      {
        "id": 2,
        "text": "иметь представление о теоретических основах алгоритмизации"
      },
      {
        "id": 3,
        "text": "уметь осуществлять редактирование и отладку программ на языке Python"
      },
      {
        "id": 4,
        "text": "построения структурных схем алгоритмов различных задач, в том числе использующих линейные, ветвящиеся и циклические алгоритмы вычислительных процессов"
      }
    ],
    "timeline": "26",
    "challenges": [
      {
        "id": 1,
        "text": "создание телеграм-ботов, сайтов, приложений, нейросетей -теория и практика на реальных задачах"
      },
      {
        "id": 2,
        "text": "использование Python для научных исследований"
      },
      {
        "id": 3,
        "text": "Поднимать веб-сервер на Python"
      },
      {
        "id": 4,
        "text": "Настраивать взаимодействие с базами данных.Проектировать базу данных и верстать веб-интерфейс на основе шаблонов Django"
      },
      {
        "id": 5,
        "text": "Настраивать и проводить тестирование своего кода"
      },
      {
        "id": 6,
        "text": "Создавать свой REST API"
      },
      {
        "id": 7,
        "text": "Использовать Docker для сборки проекта и делать свой веб-проект на Django и размещать его на сервере"
      }
    ]
  },